Revit 2024 API
ParameterTypeId.RoomDesignPowerLoadPerAreaParam Property
 "Specified Power Load per area"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId RoomDesignPowerLoadPerAreaParam { get; }
Visual Basic
Public Shared ReadOnly Property RoomDesignPowerLoadPerAreaParam As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ RoomDesignPowerLoadPerAreaParam {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace